/*`𝐒𝐓𝐀𝐓𝐔𝐒 𝐊𝐈𝐍𝐆 𝐋𝐎𝐊𝐔 𝐍𝐈𝐌𝐀𝐇`*/

const config = require('../config')
const {cmd , commands} = require('../command')
const os = require("os")
const {runtime} = require('../lib/functions')
const axios = require('axios')

cmd({

    pattern: "menu",

    react: "🤖",

    desc: "Get bot command list.",

    category: "main",

    use: '.menu',

    filename: __filename

},

async(conn, mek, m,{from, l, quoted, body, isCmd, umarmd, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply}) => {

try{
let madeMenu = `*╭══〘〘 ${config.BOT_NAME} 〙〙*
*┃🔱* *ʀᴜɴᴛɪᴍᴇ* : ${runtime(process.uptime())}
*┃🔱* *ᴍᴏᴅᴇ* : *${config.MODE}*
*┃🔱* *ᴘʀᴇғɪx* : *${config.PREFIX}*
*┃🔱* *ʀᴀᴍ ᴜsᴇ* : ${(process.memoryUsage().heapUsed / 1024 / 1024).toFixed(2)}MB / ${Math.round(require('os').totalmem / 1024 / 1024)}MB
*┃🔱* *ɴᴀᴍᴇ ʙᴏᴛ* : *❖『𝗡𝗜𝗠𝗔-𝗠𝗗 𝗩1』❖*
*┃🔱* *ᴄʀᴇᴀᴛᴏʀ* : *LOKU NIMAH*
*┃🔱* *ᴀʟᴡᴀʏs ᴏɴʟɪɴᴇ* : *${config.ALWAYS_ONLINE}*
*┃🔱* *ᴠᴇʀsɪᴏɴs* : *4.2.1*
*╰═════════════════⊷*
  😈𝗕𝗬 𝗟𝗢𝗞𝗨 𝗡𝗜𝗠𝗔😈
 *♡︎•━━━━━━☻︎━━━━━━•♡︎*
*╭────❒⁠⁠⁠⁠* *📥 𝗗𝗢𝗪𝗡𝗟𝗢𝗔𝗗𝗘𝗥-𝗡𝗜𝗠𝗔𝗛 📥* *❒⁠⁠⁠⁠* 
*├❮❮* *.ғʙ*
*├❮❮* *.ɪɴꜱᴛᴀ*
*├❮❮* *.ᴠɪᴅᴇᴏ*
*├❮❮* *.ɢᴅʀɪᴠᴇ*
*├❮❮* *.ᴛᴡɪᴛᴛᴇʀ*
*├❮❮* *.ᴛᴛ*
*├❮❮* *.ᴍᴇᴅɪᴀғɪʀᴇ*
*├❮❮* *.ᴘʟᴀʏ*
*├❮❮* *.sᴏɴɢ*
*├❮❮* *.ᴠɪᴅᴇᴏ*
*├❮❮* *.sᴘᴏᴛɪꜰʏ*
*├❮❮* *.ᴠɪᴅᴇᴏ4*
*├❮❮* *.ɪᴍɢ*
*├❮❮* *.Lʏʀɪᴄs*
*├❮❮* *.ᴀᴘᴋ*
*├❮❮* *.ʙᴀɪsᴄᴏᴘᴇ*
*├❮❮* *.ɢɪɴɪsɪsɪʟᴀ*
*┕──────────────❒*
*╭────❒⁠⁠⁠⁠* *🏮𝗘𝗠𝗣𝗜𝗥𝗘 𝗡𝗜𝗠𝗔𝗛🏮* *❒⁠⁠⁠⁠* 
*├❮❮* *.Fᴀᴍɪʟʏ*
*├❮❮* *.Vᴀᴡᴜʟᴇɴᴄᴇ*
*├❮❮* *.ᴄʜᴀɴɴᴇʟ*
*├❮❮* *.sᴜᴘᴘᴏʀᴛ*
*├❮❮* *.ᴇxᴏʀ*
*┕──────────────❒*
*╭────❒⁠⁠⁠⁠* *🔎 𝗦𝗘𝗔𝗥𝗖𝗛-𝗡𝗜𝗠𝗔𝗛 🔍* *❒⁠⁠⁠⁠* 
*├❮❮* *.ʏᴛꜱ*
*├❮❮* *.ʏᴛᴀ*
*├❮❮* *.ᴍᴏᴠɪᴇɪɴғᴏ*
*├❮❮* *.ᴍᴏᴠɪᴇ*
*├❮❮* *.Gᴏᴏɢʟᴇ*
*├❮❮* *.ᴡᴇᴀᴛʜᴇʀ*
*├❮❮* *.sᴛɪᴄᴋsᴇᴀʀᴄʜ*
*┕──────────────❒*
*╭────❒⁠⁠⁠⁠* *🎮 𝗚𝗔𝗠𝗘-𝗡𝗜𝗠𝗔𝗛 🎮* *❒⁠⁠⁠⁠* 
*├❮❮* *.ɴᴜᴍʙᴇʀɢᴀᴍᴇ*
*├❮❮* *.ʀᴏʟʟ🎲*
*├❮❮* *.ᴄᴏɪɴꜰʟɪᴘ🪙*
*├❮❮* *.pick*
*├❮❮* *.ᴋᴏɴᴀᴍɪ*
*┕──────────────❒*
*╭────❒⁠⁠⁠⁠* *🔞 𝗡𝗦𝗙𝗪-𝗡𝗜𝗠𝗔𝗛 🔞* *❒⁠⁠⁠⁠* 
*├❮❮* *.ɴsꜰᴡ*
*├❮❮* *.Eᴊᴀᴄᴜʟᴀᴛɪᴏɴ*
*├❮❮* *.ᴘᴇɴɪs*
*├❮❮* *.ᴇʀᴇᴄ*
*├❮❮* *.ɴᴜᴅᴇ*
*├❮❮* *.sᴇx*
*├❮❮* *.ᴄᴜᴛᴇ*
*├❮❮* *.ᴏʀɢᴀsᴍ*
*├❮❮* *.ᴀɴᴀʟ*
*├❮❮* *.sᴜsᴘᴇɴsɪᴏɴ*
*├❮❮* *.ᴋɪss*
*┕──────────────❒*
*╭────❒⁠⁠⁠⁠* *🧠 𝗔𝗜-𝗡𝗜𝗠𝗔𝗛 🧠* *❒⁠⁠⁠⁠* 
*├❮❮* *.ɢᴘᴛ*
*├❮❮* *.ᴀɪ*
*├❮❮* *.ᴀɴᴀʟʏsᴇ*
*├❮❮* *.ʟʟᴀᴍᴀ3*
*┕──────────────❒*
*╭────❒⁠⁠⁠⁠* *👨‍💻 𝗢𝗪𝗡𝗘𝗥-𝗡𝗜𝗠𝗔𝗛 👨‍💻* *❒⁠⁠⁠⁠* 
*├❮❮* *.ᴜᴘᴅᴀᴛᴇᴄᴍᴅ*
*├❮❮* *.sᴇᴛᴛɪɴɢs*
*├❮❮* *.ᴏᴡɴᴇʀ*
*├❮❮* *.ʀᴇᴘᴏ*
*├❮❮* *.ꜱʏꜱᴛᴇᴍ*
*├❮❮* *.ꜱᴛᴀᴛᴜꜱ*
*├❮❮* *.Aʙᴏᴜᴛ*
*├❮❮* *.ʙʟᴏᴄᴋ*
*├❮❮* *.ᴇᴠᴀʟ*
*├❮❮* *.ᴜɴʙʟᴏᴄᴋ*
*├❮❮* *.sʜᴜᴛᴅᴏᴡɴ*
*├❮❮* *.ᴄʟᴇᴀʀᴄʜᴀᴛs*
*├❮❮* *.sᴇᴛᴘᴘ*
*├❮❮* *.ʙʀᴏᴀᴅᴄᴀsᴛ*
*├❮❮* *.ᴊɪᴅ*
*├❮❮* *.ɢᴊɪᴅ*
*├❮❮* *.ᴘᴀɪʀ*
*├❮❮* *.sᴀᴠᴇ*
*├❮❮* *.ᴄᴀʟᴄ*
*├❮❮* *.ʀᴇꜱᴛᴀʀᴛ*
*├❮❮* *.𝘀𝗲𝘁𝘀𝘂𝗱𝗼*
*┕───────────────❒*
*╭────❒⁠⁠⁠⁠* *👥 𝗚𝗥𝗢𝗨𝗣-𝗡𝗜𝗠𝗔𝗛 👥* *❒⁠⁠⁠⁠* 
*├❮❮* *.ʀᴇᴍᴏᴠᴇ*
*├❮❮* *.ᴅᴇʟ*
*├❮❮* *.ᴀᴅᴅ*
*├❮❮* *.ᴋɪᴄᴋ*
*├❮❮* *.ᴋɪᴄᴋᴀʟʟ*
*├❮❮* *.sᴇᴛɢᴏᴏᴅʙʏᴇ*
*├❮❮* *.sᴇᴛᴡᴇʟᴄᴏᴍᴇ*
*├❮❮* *.ᴘʀᴏᴍᴏᴛᴇ*
*├❮❮* *.ᴅᴇᴍᴏᴛᴇ*
*├❮❮* *.ᴛᴀɢᴀʟʟ*
*├❮❮* *.ɢᴇᴛᴘɪᴄ*
*├❮❮* *.ɪɴᴠɪᴛᴇ*
*├❮❮* *.ʀᴇᴠᴏᴋᴇ*
*├❮❮* *.ᴘᴏʟʟ*
*├❮❮* *.ʀᴀɴᴅᴏᴍsʜɪᴘ*
*├❮❮* *.ɴᴇᴡɢᴄ*
*├❮❮* *.ᴊᴏɪɴʀᴇǫᴜᴇsᴛs*
*├❮❮* *.ᴀʟʟʀᴇǫ*
*├❮❮* *.ᴍᴜᴛᴇ*
*├❮❮* *.ᴜɴᴍᴜᴛᴇ*
*├❮❮* *.ʟᴏᴄᴋɢᴄ*
*├❮❮* *.ᴜɴʟᴏᴄᴋɢᴄ*
*├❮❮* *.ʟᴇᴀᴠᴇ*
*├❮❮* *.ɢɴᴀᴍᴇ*
*├❮❮* *.ɢᴅᴇsᴄ*
*├❮❮* *.ᴊᴏɪɴ*
*├❮❮* *.ʜɪᴅᴇᴛᴀɢ*
*├❮❮* *.ɢɪɴғᴏ*
*├❮❮* *.ᴇᴘʜᴇᴍᴇʀᴀʟ ᴏɴ*
*├❮❮* *.ᴇᴘʜᴇᴍᴇʀᴀʟ ᴏғғ*
*├❮❮* *.ᴇᴘʜᴇᴍᴇʀᴀʟ 7ᴅ 24ʜ 90ᴅ*
*├❮❮* *.sᴇɴᴅᴅᴍ*
*┕──────────────❒*
*╭────❒⁠⁠⁠⁠* *📃 𝗜𝗡𝗙𝗢-𝗡𝗜𝗠𝗔𝗛 📃* *❒⁠⁠⁠⁠* 
*├❮❮* *.ᴀʙᴏᴜᴛ*
*├❮❮* *.Dᴇᴠ*
*├❮❮* *.ᴋɢᴛᴇᴄʜ*
*├❮❮* *.ᴀʟɪᴠᴇ*
*├❮❮* *.ʀᴇǫᴜᴇsᴛ*
*├❮❮* *.ʙᴏᴛɪɴꜰᴏ*
*├❮❮* *.ꜱᴛᴀᴛᴜꜱ*
*├❮❮* *.ᴘɪɴɢ*
*├❮❮* *.ᴘɪɴɢ2*
*├❮❮* *.ꜱʏꜱᴛᴇᴍ*
*┕──────────────❒*
*╭────❒⁠⁠⁠⁠* *✝️ 𝗚𝗢𝗗-𝗡𝗜𝗠𝗔𝗛 ✝️* *❒⁠⁠⁠⁠* 
*├❮❮* *.ʙɪʙʟᴇ*
*├❮❮* *.ʙɪʙʟᴇʟɪsᴛ*
*┕──────────────❒*
*╭────❒⁠⁠⁠⁠* *🤖 𝗕𝗢𝗧-𝗡𝗜𝗠𝗔𝗛 🤖* *❒⁠⁠⁠⁠* 
*├❮❮* *.ᴠᴇʀsɪᴏɴ*
*├❮❮* *.ʀᴇᴘᴏ*
*├❮❮* *.ᴍᴇɴᴜ*
*├❮❮* *.ᴄʜᴇᴄᴋᴜᴘᴅᴀᴛᴇ*
*├❮❮* *.ᴜᴘᴅᴀᴛᴇ*
*├❮❮* *.ᴍᴇɴᴜ2*
*├❮❮* *.ᴍᴇɴᴜ3*
*├❮❮* *.ᴍᴏᴅᴇ*
*├❮❮* *.ᴀᴜᴛᴏᴛʏᴘɪɴɢ*
*├❮❮* *.ᴀʟᴡᴀʏsᴏɴʟɪɴᴇ*
*├❮❮* *.ᴀᴜᴛᴏʀᴇᴄᴏʀᴅɪɴɢ*
*├❮❮* *.ᴀᴜᴛᴏʀᴇᴀᴅsᴛᴀᴛᴜs*
*├❮❮* *.ᴀɴᴛɪʙᴀᴅ*
*├❮❮* *.ᴀᴜᴛᴏsᴛɪᴄᴋᴇʀ*
*├❮❮* *.ᴀᴜᴛᴏʀᴇᴘʟʏ*
*├❮❮* *.ᴀᴜᴛᴏʀᴇᴀᴄᴛ*
*├❮❮* *.ᴀɴᴛɪʟɪɴᴋ*
*┕──────────────❒*
*╭────❒⁠⁠⁠⁠* *🎡 𝗖𝗢𝗡𝗩𝗘𝗥𝗧𝗘𝗥-𝗡𝗜𝗠𝗔𝗛 🎡* *❒⁠⁠⁠⁠* 
*├❮❮* *.sᴛɪᴄᴋᴇʀ*
*├❮❮* *.ᴛᴀᴋᴇ*
*├❮❮* *.ᴛʀᴛ*
*├❮❮* *.ᴛᴛs*
*├❮❮* *.ꜰᴀɴᴄʏ*
*├❮❮* *.ᴜʀʟ*
*├❮❮* *.sᴇɴᴅɪᴍᴀɢᴇ*
*├❮❮* *.Aɢᴇ*
*├❮❮* *.Cᴏɴᴠᴇʀᴛ*
*├❮❮* *.ᴛɪɴʏ*
*├❮❮* *.ᴛɢs*
*┕────────────❒*
*╭───❒⁠⁠⁠⁠* *⛱️ 𝗥𝗔𝗡𝗗𝗢𝗢𝗠-𝗡𝗜𝗠𝗔𝗛 ⛱️* *❒⁠⁠⁠⁠* 
*├❮❮* *.ᴋᴇʀᴍ*
*├❮❮* *.ᴅᴏɢ*
*├❮❮* *.ᴄᴀᴛ*
*├❮❮* *.ᴅɪᴀʀʏ*
*├❮❮* *.ᴀɴɪᴍᴇ*
*├❮❮* *.ᴄᴏᴜᴘʟᴇᴘᴘ*
*├❮❮* *.ꜰɪɴᴅɴᴀᴍᴇ*
*├❮❮* *.ʟᴏʟɪ*
*├❮❮* *.ᴡᴀɪꜰᴜ*
*├❮❮* *.ᴄᴏsᴘʟᴀʏ*
*├❮❮* *.ɴᴇᴋᴏ*
*├❮❮* *.ʀᴀɴᴅᴏᴍᴀɴɪᴍᴇ*
*├❮❮* *.Sᴇɴᴅɪᴍᴀɢᴇ*
*├❮❮* *.ᴀɴɪᴍᴇɢɪʀʟ*
*├❮❮* *.ᴀɴɪᴍᴇɢɪʀʟ1*
*├❮❮* *.ᴀɴɪᴍᴇɢɪʀʟ2*
*├❮❮* *.ᴀɴɪᴍᴇɢɪʀʟ3*
*├❮❮* *.ᴀɴɪᴍᴇɢɪʀʟ4*
*├❮❮* *.ᴀɴɪᴍᴇɢɪʀʟ5*
*├❮❮* *.ᴘɪᴄᴋᴜᴘʟɪɴᴇ*
*┕──────────────❒*
*╭────❒⁠⁠⁠⁠* *🏜️ 𝗪𝗔𝗟𝗟𝗣𝗔𝗣𝗘𝗥𝗦-𝗡𝗜𝗠𝗔𝗛 🏜️* *❒⁠⁠⁠⁠* 
*├❮❮* *.ɪᴍɢ*
*├❮❮* *.ʟᴏɢᴏ*
*├❮❮* *.ss*
*┕──────────────❒*
*╭────❒⁠⁠⁠⁠* *🌐 𝗢𝗧𝗛𝗘𝗥-𝗡𝗜𝗠𝗔𝗛🌐* *❒⁠⁠⁠⁠* 
*├❮❮* *.ᴛʀᴛ*
*├❮❮* *.ᴊᴏᴋᴇ*
*├❮❮* *.ꜰᴀᴄᴛ*
*├❮❮* *.ɢɪᴛʜᴜʙ*
*├❮❮* *.ɢᴘᴀꜱꜱ*
*├❮❮* *.ʜᴀᴄᴋ*
*├❮❮* *.ǫᴜᴏᴛᴇ*
*├❮❮* *.ǫʀ*
*├❮❮* *.vv*
*├❮❮* *.sᴘᴀᴍ*
*├❮❮* *.ᴠᴄᴀʀᴅ*
*├❮❮* *.ꜱʀᴇᴘᴏ*
*├❮❮* *.sʏsᴛᴇᴍ*
*├❮❮* *.ʀᴀɴᴋ*
*├❮❮* *.Tɪᴍᴇᴢᴏɴᴇ*
*├❮❮* *.ᴅᴇꜰɪɴᴇ*
*├❮❮* *.Dᴀɪʟʏꜰᴀᴄᴛ*
*├❮❮* *.Mɪɴᴜᴛᴏʀ*
*┕─────────────❒*
`

await conn.sendMessage(from,{image:{url:config.ALIVE_IMG},caption:madeMenu,
                          contextInfo: {
    mentionedJid: [m.sender],
    forwardingScore: 999,
    isForwarded: true,
    forwardedNewsletterMessageInfo: {
      newsletterJid: '120363357955960414@newsletter',
      newsletterName: '𝗡𝗜𝗜𝗠𝗔-𝗠𝗗 1𝗩',
      serverMessageId: 999
    }
  }
}, { quoted: mek });
}catch(e){
console.log(e)
reply(`${e}`)
}
})
